//  Створити масив, довжину та елементи якого задає користувач. 
// Відсортувати масив за зростанням.
// Видалити елементи з масиву з 2 по 4 (включно!).
// У міру змін виводити вміст масиву на сторінку.



let str = prompt("Введіть елементи масива через кому");
alert (`Введений масив: ${str}`);
var numbers = str.split(', ');

numbers.sort(function(a, b) {
  return a - b;
});
alert (`Відсортований масив: ${numbers}`);

numbers.splice(2, 3);
console.log(`Масив з видаленими елементами: ${numbers}`);

